app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY '') LIMIT 1
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.sso_site_id = @sso_selected_site.id
    @user.host_token = @host_token
    success = @user && @user.save
    if success && @user.errors.empty?
      @user.activate!
      redirect_to root_url
      flash[:notice] = "Thanks for signing up!  We're sending you an email with your activation code."
    else
      flash[:error]  = "We couldn't set up that account, sorry.  Please try again, or contact an admin (link is above)."
      flash[:error] += "\n<ul><li>#{@user.errors.collect{|e| "#{e.first.to_s.humanize} #{e.last}"}.join('</li><li>')}</li></ul>"